# Homework 1

### Import libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_classification = pd.read_csv('../csv_file/classification.csv')
df_classification.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,y
0,999,blue-collar,married,basic.4y,unknown,no,yes,cellular,105.0,1,999.0,0,nonexistent,no
1,36,blue-collar,married,basic.6y,no,yes,no,cellular,125.0,5,999.0,0,nonexistent,no
2,999,admin.,single,high.school,no,no,yes,telephone,111.0,1,999.0,0,nonexistent,no
3,39,blue-collar,married,basic.6y,unknown,no,no,cellular,173.0,2,999.0,0,nonexistent,no
4,41,housemaid,married,basic.4y,unknown,no,no,cellular,107.0,1,999.0,0,nonexistent,no

In [3]:
df_regression = pd.read_csv('../csv_file/regression.csv')
df_regression.head()

,Employee_Name,EmpID,EmpStatusID,Salary,Termd,DOB,Gender,MaritalDesc,CitizenDesc,DateofHire,DateofTermination,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,1.0,62506,0,7/10/1983,M,Single,US Citizen,7/5/2011,NaN,Exceeds,4.60,5,0,0,1
1,"Ait Sidi, Karthikeyan",10084,5.0,104437,1,5/5/1975,M,Married,US Citizen,3/30/2015,6/16/2016,Fully Meets,4.96,3,6,0,17
2,"Akinkuolie, Sarah",10196,5.0,64955,1,9/19/1988,F,Married,US Citizen,7/5/2011,9/24/2012,Fully Meets,3.02,3,0,0,3
3,"Alagbe,Trina",10088,1.0,64991,0,9/27/1988,F,Married,US Citizen,1/7/2008,NaN,Fully Meets,4.84,5,0,0,15
4,"Anderson, Carol",10069,5.0,50825,1,9/8/1989,F,Divorced,US Citizen,7/11/2011,9/6/2016,Fully Meets,5.00,4,0,0,2

### Answer 1 
Missing values

In [4]:
df_classification.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Data columns (total 14 columns):
age          4119 non-null int64
job          4119 non-null object
marital      3991 non-null object
education    4119 non-null object
default      4119 non-null object
housing      4119 non-null object
loan         4119 non-null object
contact      4119 non-null object
duration     4007 non-null float64
campaign     4119 non-null int64
pdays        3958 non-null float64
previous     4119 non-null int64
poutcome     4119 non-null object
y            4119 non-null object
dtypes: float64(2), int64(3), object(9)
memory usage: 450.6+ KB

In [5]:
for i,row in df_classification.iterrows():
    if not row['age']:
        print("NULL")
    if row['pdays'] == ' ':
        print("BLANK SPACE")

Columns `marital`, `duration` and `pdays` have missing values based on the info of the dataframe above.

#### Type of missing values in the columns `marital`, `duration` and `pdays`

In [6]:
df_classification[df_classification['marital'].isnull()].head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,y
58,27,student,NaN,high.school,unknown,yes,no,telephone,38.0,9,999.0,0,nonexistent,no
59,44,management,NaN,professional.course,no,no,no,cellular,65.0,1,999.0,1,failure,no
68,55,management,NaN,university.degree,no,no,no,cellular,171.0,2,999.0,0,nonexistent,no
88,32,management,NaN,university.degree,no,yes,no,cellular,129.0,2,999.0,0,nonexistent,no
137,37,entrepreneur,NaN,basic.9y,no,no,no,cellular,69.0,1,999.0,0,nonexistent,no

In [7]:
df_classification[df_classification['duration'].isnull()].head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,y
30,57,retired,married,basic.4y,unknown,yes,no,telephone,NaN,1,999.0,0,nonexistent,no
192,29,technician,unknown,high.school,no,yes,no,cellular,NaN,3,999.0,0,nonexistent,no
249,29,blue-collar,married,basic.9y,no,yes,no,cellular,NaN,1,999.0,0,nonexistent,yes
300,50,technician,divorced,university.degree,unknown,no,no,cellular,NaN,2,999.0,0,nonexistent,no
332,43,blue-collar,married,basic.9y,unknown,unknown,unknown,cellular,NaN,1,999.0,0,nonexistent,no

In [8]:
df_classification[df_classification['pdays'].isnull()].head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,y
21,38,admin.,married,high.school,unknown,no,no,cellular,203.0,1,NaN,0,nonexistent,no
40,32,admin.,divorced,high.school,no,yes,no,cellular,134.0,1,NaN,0,nonexistent,no
87,56,blue-collar,married,unknown,no,yes,no,cellular,178.0,8,NaN,0,nonexistent,no
109,35,technician,single,professional.course,no,yes,yes,cellular,63.0,4,NaN,0,nonexistent,no
131,59,blue-collar,married,unknown,no,no,no,cellular,124.0,2,NaN,0,nonexistent,no

It can be observed that the missing values are of type np.nan

### Answer 2
Counting missing values in the dataset

Replacing 999 with np.NaN

In [9]:
df_classification['age'].describe()

count    4119.000000
mean       90.199077
std       213.543589
min        18.000000
25%        32.000000
50%        39.000000
75%        49.000000
max       999.000000
Name: age, dtype: float64

In [10]:
df_classification['age'].replace(999.0, np.NaN,inplace = True)

In [11]:
df_classification['age'].describe()

count    3904.000000
mean       40.149846
std        10.526973
min        18.000000
25%        32.000000
50%        38.000000
75%        47.000000
max        95.000000
Name: age, dtype: float64

In [12]:
df_classification.isna().sum()

age          215
job            0
marital      128
education      0
default        0
housing        0
loan           0
contact        0
duration     112
campaign       0
pdays        161
previous       0
poutcome       0
y              0
dtype: int64

In [13]:
df_classification.isna().sum().sum()

616

### Answer 3

Percentage of the rows having at least one missing value

In [14]:
df_classification.isnull().any(axis=1).sum()

585

In [15]:
(df_classification.isnull().any(axis=1).sum() / len(df_classification))*100

14.202476329206117

### Answer 4

Columns with missing values

In [16]:
columns_missing_count = df_classification.isna().sum()
columns_with_missing_values = columns_missing_count[columns_missing_count > 0 ]
columns_with_missing_values.size

4

## Answer 5 
Median of column `duration`

In [17]:
df_classification['duration'].median()

182.0

### Answer 6
Missing values

In [18]:
df_regression.isnull().any(axis=1).sum()

213

In [19]:
df_regression.isna().sum()

Employee_Name             0
EmpID                     0
EmpStatusID               9
Salary                    0
Termd                     0
DOB                       0
Gender                    0
MaritalDesc               4
CitizenDesc               4
DateofHire                0
DateofTermination       207
PerformanceScore          0
EngagementSurvey          0
EmpSatisfaction           0
SpecialProjectsCount      0
DaysLateLast30            0
Absences                  0
dtype: int64

In [20]:
df_regression[df_regression['EmpStatusID'].isnull()].head()

,Employee_Name,EmpID,EmpStatusID,Salary,Termd,DOB,Gender,MaritalDesc,CitizenDesc,DateofHire,DateofTermination,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences
58,"Crimmings, Jean",10132,NaN,56149,0,4/10/1987,F,Single,US Citizen,7/6/2016,NaN,Fully Meets,4.12,5,0,0,15
59,"Cross, Noah",10083,NaN,92329,0,9/9/1965,M,Single,US Citizen,11/10/2014,NaN,Fully Meets,5.00,3,4,0,5
68,"Demita, Carla",10100,NaN,58275,1,2/25/1951,F,Separated,US Citizen,4/4/2011,11/4/2015,Fully Meets,4.62,5,0,0,1
88,"Fancett, Nicole",10136,NaN,65902,0,9/27/1987,F,Single,US Citizen,2/17/2014,NaN,Fully Meets,4.00,4,0,0,7
137,"Immediato, Walter",10289,NaN,83082,1,11/15/1976,M,Married,US Citizen,2/21/2011,9/24/2012,Needs Improvement,2.34,2,0,3,4

In [21]:
df_regression[df_regression['MaritalDesc'].isnull()].head()

,Employee_Name,EmpID,EmpStatusID,Salary,Termd,DOB,Gender,MaritalDesc,CitizenDesc,DateofHire,DateofTermination,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences
40,"Carter, Michelle",10040,1.0,71860,0,5/15/1963,F,NaN,US Citizen,8/18/2014,NaN,Fully Meets,5.00,5,0,0,7
109,"Goeth, Amon",10228,1.0,74679,0,11/24/1989,M,NaN,US Citizen,3/30/2015,NaN,Fully Meets,4.30,5,7,0,20
171,"Lundy, Susan",10096,5.0,67237,1,12/26/1976,F,NaN,US Citizen,7/8/2013,9/15/2016,Fully Meets,4.65,4,0,0,15
298,"Wang, Charlie",10172,1.0,84903,0,7/8/1981,M,NaN,US Citizen,2/15/2017,NaN,Fully Meets,3.42,4,7,0,17

In [22]:
df_regression[df_regression['CitizenDesc'].isnull()].head()

,Employee_Name,EmpID,EmpStatusID,Salary,Termd,DOB,Gender,MaritalDesc,CitizenDesc,DateofHire,DateofTermination,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences
30,"Buccheri, Joseph",10184,1.0,65288,0,7/28/1983,M,Single,NaN,9/29/2014,NaN,Fully Meets,3.19,3,0,0,9
192,"Moran, Patrick",10223,3.0,72106,0,12/3/1976,M,Single,NaN,1/9/2012,NaN,Fully Meets,4.10,4,0,0,12
249,"Salter, Jason",10229,5.0,88527,1,12/17/1987,M,Divorced,NaN,1/5/2015,10/31/2015,Fully Meets,4.20,3,5,0,2
300,"Whittier, Scott",10072,5.0,58371,1,5/24/1987,M,Single,NaN,1/10/2011,5/15/2014,Fully Meets,5.00,5,0,0,11

In [23]:
for i,row in df_regression.iterrows():
    if not row['CitizenDesc']:
        print("NULL")
    if row['CitizenDesc'] == ' ':
        print("BLANK SPACE")

In [24]:
df_regression.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 17 columns):
Employee_Name           311 non-null object
EmpID                   311 non-null int64
EmpStatusID             302 non-null float64
Salary                  311 non-null int64
Termd                   311 non-null int64
DOB                     311 non-null object
Gender                  311 non-null object
MaritalDesc             307 non-null object
CitizenDesc             307 non-null object
DateofHire              311 non-null object
DateofTermination       104 non-null object
PerformanceScore        311 non-null object
EngagementSurvey        311 non-null float64
EmpSatisfaction         311 non-null int64
SpecialProjectsCount    311 non-null int64
DaysLateLast30          311 non-null int64
Absences                311 non-null int64
dtypes: float64(2), int64(7), object(8)
memory usage: 41.4+ KB

In [25]:
df_regression[df_regression['DateofTermination'].isnull()].head()

,Employee_Name,EmpID,EmpStatusID,Salary,Termd,DOB,Gender,MaritalDesc,CitizenDesc,DateofHire,DateofTermination,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,1.0,62506,0,7/10/1983,M,Single,US Citizen,7/5/2011,NaN,Exceeds,4.60,5,0,0,1
3,"Alagbe,Trina",10088,1.0,64991,0,9/27/1988,F,Married,US Citizen,1/7/2008,NaN,Fully Meets,4.84,5,0,0,15
5,"Anderson, Linda",10002,1.0,57568,0,5/22/1977,F,Single,US Citizen,1/9/2012,NaN,Exceeds,5.00,5,0,0,15
6,"Andreola, Colby",10194,1.0,95660,0,5/24/1979,F,Single,US Citizen,11/10/2014,NaN,Fully Meets,3.04,3,4,0,19
7,"Athwal, Sam",10062,1.0,59365,0,2/18/1983,M,Widowed,US Citizen,9/30/2013,NaN,Fully Meets,5.00,4,0,0,19

### Answer 7

##### Converting datatype of `DateofTermination` to datetime

In [26]:
df_regression['DateofTermination'] = pd.to_datetime(df_regression['DateofTermination'])
df_regression.dtypes

Employee_Name                   object
EmpID                            int64
EmpStatusID                    float64
Salary                           int64
Termd                            int64
DOB                             object
Gender                          object
MaritalDesc                     object
CitizenDesc                     object
DateofHire                      object
DateofTermination       datetime64[ns]
PerformanceScore                object
EngagementSurvey               float64
EmpSatisfaction                  int64
SpecialProjectsCount             int64
DaysLateLast30                   int64
Absences                         int64
dtype: object

##### Converting datatype of `DateofHire` to datetime

In [27]:
df_regression['DateofHire'] = pd.to_datetime(df_regression['DateofHire'])
df_regression.dtypes

Employee_Name                   object
EmpID                            int64
EmpStatusID                    float64
Salary                           int64
Termd                            int64
DOB                             object
Gender                          object
MaritalDesc                     object
CitizenDesc                     object
DateofHire              datetime64[ns]
DateofTermination       datetime64[ns]
PerformanceScore                object
EngagementSurvey               float64
EmpSatisfaction                  int64
SpecialProjectsCount             int64
DaysLateLast30                   int64
Absences                         int64
dtype: object

##### Replacing missing dates with '1/1/2022'

In [28]:
df_regression['DateofTermination'].replace(np.NaN, '1/1/2022',inplace = True)

In [29]:
df_regression['DateofHire'].replace(np.NaN, '1/1/2022',inplace = True)

In [30]:
df_regression['DateofTermination'].isna().sum()

0

In [31]:
df_regression['DateofHire'].isna().sum()

0

##### Calculating 'Years of Tenure'

In [32]:
df_regression.dtypes

Employee_Name                   object
EmpID                            int64
EmpStatusID                    float64
Salary                           int64
Termd                            int64
DOB                             object
Gender                          object
MaritalDesc                     object
CitizenDesc                     object
DateofHire              datetime64[ns]
DateofTermination               object
PerformanceScore                object
EngagementSurvey               float64
EmpSatisfaction                  int64
SpecialProjectsCount             int64
DaysLateLast30                   int64
Absences                         int64
dtype: object

In [33]:
df_regression['DateofHire'] = df_regression['DateofHire'].astype(np.datetime64) 
df_regression['DateofTermination'].fillna('1/1/2022', inplace = True) 
df_regression['DateofTermination'] = df_regression['DateofTermination'].astype(np.datetime64) 
df_regression['years_of_tenure'] = df_regression['DateofTermination'].dt.year - df_regression['DateofHire'].dt.year 
df_regression['years_of_tenure'] = df_regression['years_of_tenure'].astype(int)

In [34]:
df_regression['years_of_tenure'].mean()

6.961414790996785

 #### drop the columns DateofHire and DateofTermination

In [35]:
df_regression = df_regression.drop(['DateofTermination', 'DateofHire'], axis=1)
df_regression.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 16 columns):
Employee_Name           311 non-null object
EmpID                   311 non-null int64
EmpStatusID             302 non-null float64
Salary                  311 non-null int64
Termd                   311 non-null int64
DOB                     311 non-null object
Gender                  311 non-null object
MaritalDesc             307 non-null object
CitizenDesc             307 non-null object
PerformanceScore        311 non-null object
EngagementSurvey        311 non-null float64
EmpSatisfaction         311 non-null int64
SpecialProjectsCount    311 non-null int64
DaysLateLast30          311 non-null int64
Absences                311 non-null int64
years_of_tenure         311 non-null int32
dtypes: float64(2), int32(1), int64(7), object(6)
memory usage: 37.7+ KB

### Answer 8

#### Calculating 'Birth of each employee'

In [36]:
df_regression['DOB'] = df_regression['DOB'].astype(np.datetime64) 
df_regression['Age'] = 2022 - df_regression['DOB'].dt.year 
df_regression['Age'].median()

42.0

#### Drop the column DOB

In [37]:
df_regression = df_regression.drop(['DOB'], axis=1)
df_regression.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 16 columns):
Employee_Name           311 non-null object
EmpID                   311 non-null int64
EmpStatusID             302 non-null float64
Salary                  311 non-null int64
Termd                   311 non-null int64
Gender                  311 non-null object
MaritalDesc             307 non-null object
CitizenDesc             307 non-null object
PerformanceScore        311 non-null object
EngagementSurvey        311 non-null float64
EmpSatisfaction         311 non-null int64
SpecialProjectsCount    311 non-null int64
DaysLateLast30          311 non-null int64
Absences                311 non-null int64
years_of_tenure         311 non-null int32
Age                     311 non-null int64
dtypes: float64(2), int32(1), int64(8), object(5)
memory usage: 37.7+ KB

#### Ans 9

In [38]:
df_regression.isnull().any(axis=1).sum()

17

#### Ans 10

In [39]:
df_regression['Absences'].mean()

10.237942122186496

### HOMEWORK_2
### Ans1

#### Imputing Missing value in the column 'marital' with the most frequent value in this column

In [40]:
df_classification['marital'].value_counts()

married     2456
single      1099
divorced     424
unknown       12
Name: marital, dtype: int64

In [41]:
df_classification['marital'].fillna('married', inplace = True)

In [42]:
df_classification['marital'].value_counts()

married     2584
single      1099
divorced     424
unknown       12
Name: marital, dtype: int64

### Ans 2

### Plot the histogram of column 'duration'

In [43]:
df_classification['duration'].hist()

### Ans 3

### Replace the missing values in the column 'duration' with the median of all available values in this column

In [44]:
df_classification['duration'].median()

182.0

In [45]:
df_classification['duration'].fillna(df_classification['duration'].median(), inplace = True)

In [46]:
type(df_classification['duration'][0])

numpy.float64

In [47]:
df_classification['duration'].mean()

259.2425345957757

### Ans 4

Study the column 'pdays'. You can see that the customer is not contacted previously,
represented as 999 in this dataset, or the number of days that passed by after the client was last contacted. 
We want to replace this column with a binary column with' not-contacted' and 'contacted' values. 
What is the frequency of 'contacted' after the data transformation?

In [48]:
df_classification['pdays'].value_counts()

999.0    3802
3.0        47
6.0        45
4.0        13
7.0         7
2.0         7
12.0        6
9.0         4
13.0        4
8.0         3
16.0        3
10.0        3
14.0        3
1.0         3
0.0         2
5.0         2
22.0        1
11.0        1
18.0        1
15.0        1
Name: pdays, dtype: int64

In [49]:
df_classification['pdays'].isna().sum()

161

In [50]:
df_classification.loc[df_classification['pdays'] < 999, 'pdays'] = 'contacted'
df_classification.loc[df_classification['pdays'] == 999, 'pdays'] = 'not-contacted'

In [51]:
df_classification['pdays'].value_counts()

not-contacted    3802
contacted         156
Name: pdays, dtype: int64

### Ans 5

(Part a)In the column 'pdays' after the transformation, replace the missing values with the value of the most frequent class in this column.
What is the frequency of the most frequent class after the data imputation?

In [52]:
df_classification['pdays'].isna().sum()

161

In [53]:
df_classification['pdays'].fillna('not-contacted', inplace = True)

In [54]:
df_classification['pdays'].value_counts()

not-contacted    3963
contacted         156
Name: pdays, dtype: int64

### Ans 6

### Replace the missing values in the column 'age' with the mean of all the available values. 
What is the mean of this column after the data imputation? Enter the answer with four digits after the decimal point.

In [55]:
df_classification['age'].mean()

40.14984631147541

In [56]:
df_classification['age'].fillna(df_classification['age'].mean() , inplace = True)

In [57]:
df_classification['age'].mean()

40.14984631147537

### Ans 7

(Part a)What should be an appropriate data transformations strategy for the column 'job'?
(Apply the transformation on the data frame)

In [58]:
df_classification.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,y
0,40.149846,blue-collar,married,basic.4y,unknown,no,yes,cellular,105.0,1,not-contacted,0,nonexistent,no
1,36.000000,blue-collar,married,basic.6y,no,yes,no,cellular,125.0,5,not-contacted,0,nonexistent,no
2,40.149846,admin.,single,high.school,no,no,yes,telephone,111.0,1,not-contacted,0,nonexistent,no
3,39.000000,blue-collar,married,basic.6y,unknown,no,no,cellular,173.0,2,not-contacted,0,nonexistent,no
4,41.000000,housemaid,married,basic.4y,unknown,no,no,cellular,107.0,1,not-contacted,0,nonexistent,no

In [59]:
df_classification['job'].value_counts()

admin.           1098
blue-collar       900
technician        672
services          375
management        278
retired           178
entrepreneur      147
self-employed     120
unemployed        116
housemaid         111
student            89
unknown            35
Name: job, dtype: int64

In [60]:
cols_job = pd.get_dummies(df_classification['job'], prefix= 'job')
df_classification[cols_job.columns] = cols_job
df_classification.drop('job', axis = 1, inplace = True)

### Ans 8

What should be an appropriate data transformations strategy for the column 'marital'? 
(Apply the transformation on the data frame)

In [61]:
df_classification['marital'].value_counts()

married     2584
single      1099
divorced     424
unknown       12
Name: marital, dtype: int64

In [62]:
cols_marital = pd.get_dummies(df_classification['marital'], prefix= 'marital')
df_classification[cols_marital.columns] = cols_marital
df_classification.drop('marital', axis = 1, inplace = True)

### Ans 9

In the column 'education', one of the values is 'unknown. 
This value can be considered as a sentinel value.
We want to replace it with the value of the most frequent class in this column. 
What is the frequency of the most frequent class after the data imputation?

In [63]:
df_classification['education'].value_counts()

university.degree      1231
high.school             942
basic.9y                612
professional.course     530
basic.4y                418
basic.6y                223
unknown                 160
illiterate                3
Name: education, dtype: int64

In [64]:
df_classification['education'].replace(to_replace ="unknown",
                 value ="university.degree").value_counts()

university.degree      1391
high.school             942
basic.9y                612
professional.course     530
basic.4y                418
basic.6y                223
illiterate                3
Name: education, dtype: int64

### Ans 10

Appropriate data transformations strategy for the column 'education'

In [65]:
df_classification['education'] = df_classification['education'].map(
    {'illiterate':0, 'basic.4y': 1, 'basic.6y': 2, 'basic.9y': 3, 'high.school': 4,
     'professional.course':5, 'university.degree':6})

In [66]:
df_classification.head()

,age,education,default,housing,loan,contact,duration,campaign,pdays,previous,...,job_self-employed,job_services,job_student,job_technician,job_unemployed,job_unknown,marital_divorced,marital_married,marital_single,marital_unknown
0,40.149846,1.0,unknown,no,yes,cellular,105.0,1,not-contacted,0,...,0,0,0,0,0,0,0,1,0,0
1,36.000000,2.0,no,yes,no,cellular,125.0,5,not-contacted,0,...,0,0,0,0,0,0,0,1,0,0
2,40.149846,4.0,no,no,yes,telephone,111.0,1,not-contacted,0,...,0,0,0,0,0,0,0,0,1,0
3,39.000000,2.0,unknown,no,no,cellular,173.0,2,not-contacted,0,...,0,0,0,0,0,0,0,1,0,0
4,41.000000,1.0,unknown,no,no,cellular,107.0,1,not-contacted,0,...,0,0,0,0,0,0,0,1,0,0

### Ans 11

What should be an appropriate data transformations strategy for the column 'default'

In [67]:
df_classification['default'].value_counts()

no         3281
unknown     838
Name: default, dtype: int64

In [68]:
df_classification['default'] = df_classification['default'].map({'no':1, 'unknown':0}).astype(int)

### Ans 12

In the column 'housing', one of the values is 'unknown.
This value can be considered as a sentinel value.
We want to replace it with the value of the most frequent class in this column.
What is the frequency of the most frequent class after the data imputation?

In [69]:
df_classification['housing'].value_counts()

yes        2140
no         1870
unknown     109
Name: housing, dtype: int64

In [70]:
df_classification['housing'].replace("unknown", "yes", inplace = True)

In [71]:
df_classification['housing'].value_counts()

yes    2249
no     1870
Name: housing, dtype: int64

### Ans 13

In [72]:
df_classification['housing'] = df_classification['housing'].map({'yes':1, 'no':0}).astype(int)

### Ans 14

In the column 'loan', one of the values is 'unknown'. 
This value can be considered as a sentinel value. 
We want to replace it with the value of the most frequent class in this column. 
What should be an appropriate data transformations strategy for the column 'loan'?

In [73]:
df_classification['loan'].value_counts()

no         3384
yes         626
unknown     109
Name: loan, dtype: int64

In [74]:
df_classification['loan'].replace("unknown", "no", inplace = True)

In [75]:
df_classification['loan'].value_counts()

no     3493
yes     626
Name: loan, dtype: int64

In [76]:
df_classification['loan'] = df_classification['loan'].map({'no':1, 'yes':0}).astype(int)

### Ans 15

What should be an appropriate data transformations strategy for the column 'contact'?

In [77]:
df_classification['contact'].value_counts()

cellular     2585
telephone    1534
Name: contact, dtype: int64

In [78]:
df_classification['contact'] = df_classification['contact'].map({'cellular':1, 'telephone':0}).astype(int)

### Ans 16

What should be an appropriate data transformations strategy for the column 'pdays'?

In [79]:
df_classification['pdays'].value_counts()

not-contacted    3963
contacted         156
Name: pdays, dtype: int64

In [80]:
df_classification['pdays'] = df_classification['pdays'].map({'not-contacted':1, 'contacted':0}).astype(int)

### Ans 17

What should be an appropriate data transformations strategy for the column 'poutcome'

In [81]:
df_classification['poutcome'].value_counts()

nonexistent    3566
failure         404
success         149
Name: poutcome, dtype: int64

In [82]:
cols_poutcome = pd.get_dummies(df_classification['poutcome'], prefix= 'poutcome')
df_classification[cols_poutcome.columns] = cols_poutcome
df_classification.drop('poutcome', axis = 1, inplace = True)

### Ans 18

To answer this and the next two questions, replace the missing values with the most frequent class in each column. 
What is the frequency of the most frequent class in the column EmpStatusID after the data imputation?

In [83]:
df_regression['EmpStatusID'].value_counts()

1.0    180
5.0     85
4.0     14
3.0     14
2.0      9
Name: EmpStatusID, dtype: int64

In [84]:
df_regression['EmpStatusID'].fillna(1.0, inplace = True)

In [85]:
df_regression['EmpStatusID'].value_counts()

1.0    189
5.0     85
4.0     14
3.0     14
2.0      9
Name: EmpStatusID, dtype: int64

### Ans 19

What is the frequency of the most frequent class in the column MaritalDesc

In [86]:
df_regression['MaritalDesc'].value_counts()

Single       135
Married      123
Divorced      30
Separated     12
Widowed        7
Name: MaritalDesc, dtype: int64

In [87]:
df_regression['MaritalDesc'].fillna('Single', inplace = True)

In [88]:
df_regression['MaritalDesc'].value_counts()

Single       139
Married      123
Divorced      30
Separated     12
Widowed        7
Name: MaritalDesc, dtype: int64

### Ans 20

What is the frequency of the most frequent class in the column CitizenDesc

In [89]:
df_regression['CitizenDesc'].value_counts()

US Citizen             291
Eligible NonCitizen     12
Non-Citizen              4
Name: CitizenDesc, dtype: int64

In [90]:
df_regression['CitizenDesc'].fillna('US Citizen', inplace = True)

In [91]:
df_regression['CitizenDesc'].value_counts()

US Citizen             295
Eligible NonCitizen     12
Non-Citizen              4
Name: CitizenDesc, dtype: int64

### Ans 21

At this point the part b dataset should not have any missing values. 
If you are still inspecting any missing valuee, please go back and check your code. 
Our goal is to predict the salary of each employee based on the available data in this dataset. 
Which of the columns do not contribute any meaningful information for this task? Drop these columns from your dataset

In [92]:
df_regression.isnull().sum()

Employee_Name           0
EmpID                   0
EmpStatusID             0
Salary                  0
Termd                   0
Gender                  0
MaritalDesc             0
CitizenDesc             0
PerformanceScore        0
EngagementSurvey        0
EmpSatisfaction         0
SpecialProjectsCount    0
DaysLateLast30          0
Absences                0
years_of_tenure         0
Age                     0
dtype: int64

In [93]:
df_regression.drop(['Employee_Name', 'EmpID'], axis = 1, inplace = True)

### Ans 22

What would be the best feature transformation for the column EmpStatusID? 
Apply the proper transformation to your dataset

In [94]:
df_regression['EmpStatusID'].value_counts()

1.0    189
5.0     85
4.0     14
3.0     14
2.0      9
Name: EmpStatusID, dtype: int64

In [95]:
cols_EmpStatusID = pd.get_dummies(df_regression['EmpStatusID'], prefix= 'EmpStatusID')
df_regression[cols_EmpStatusID.columns] = cols_EmpStatusID
df_regression.drop('EmpStatusID', axis = 1, inplace = True)

### Ans 23

What would be the best feature transformation for the column MaritalDesc? 
Apply the proper transformation to the dataset.

In [96]:
df_regression['MaritalDesc'].value_counts()

Single       139
Married      123
Divorced      30
Separated     12
Widowed        7
Name: MaritalDesc, dtype: int64

In [97]:
cols_maritalDesc = pd.get_dummies(df_regression['MaritalDesc'], prefix= 'MaritalDesc')
df_regression[cols_maritalDesc.columns] = cols_maritalDesc
df_regression.drop('MaritalDesc', axis = 1, inplace = True)

### Ans 24

What would be the best feature transformation for the column CitizenDesc? 
Apply the proper transformation to the dataset

In [98]:
df_regression['CitizenDesc'].value_counts()

US Citizen             295
Eligible NonCitizen     12
Non-Citizen              4
Name: CitizenDesc, dtype: int64

In [99]:
cols_CitizenDesc = pd.get_dummies(df_regression['CitizenDesc'], prefix= 'CitizenDesc')
df_regression[cols_CitizenDesc.columns] = cols_CitizenDesc
df_regression.drop('CitizenDesc', axis = 1, inplace = True)

### Ans 25

What would be the best feature transformation for the column PerformanceScore? 
Apply the proper tranformation on the dataset

In [100]:
df_regression['PerformanceScore'].value_counts()

Fully Meets          243
Exceeds               37
Needs Improvement     18
PIP                   13
Name: PerformanceScore, dtype: int64

In [101]:
df_regression['PerformanceScore'] = df_regression['PerformanceScore'].map(
    {'Exceeds':3, 'Fully Meets':2, 'Needs Improvement':1, 'PIP':0}).astype(int)

In [102]:
df_regression.head()

,Salary,Termd,Gender,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,DaysLateLast30,Absences,years_of_tenure,...,EmpStatusID_4.0,EmpStatusID_5.0,MaritalDesc_Divorced,MaritalDesc_Married,MaritalDesc_Separated,MaritalDesc_Single,MaritalDesc_Widowed,CitizenDesc_Eligible NonCitizen,CitizenDesc_Non-Citizen,CitizenDesc_US Citizen
0,62506,0,M,3,4.60,5,0,0,1,11,...,0,0,0,0,0,1,0,0,0,1
1,104437,1,M,2,4.96,3,6,0,17,1,...,0,1,0,1,0,0,0,0,0,1
2,64955,1,F,2,3.02,3,0,0,3,1,...,0,1,0,1,0,0,0,0,0,1
3,64991,0,F,2,4.84,5,0,0,15,14,...,0,0,0,1,0,0,0,0,0,1
4,50825,1,F,2,5.00,4,0,0,2,5,...,0,1,1,0,0,0,0,0,0,1

### Ans 26

What would be the best feature transformation for the column Gender? 
Apply the proper tranformation on the dataset

In [103]:
df_regression['Gender'].value_counts()

F    176
M    135
Name: Gender, dtype: int64

In [104]:
df_regression['Gender'] = df_regression['Gender'].map({'F':1, 'M':0}).astype(int)

### Ans 27

 What is the number of columns in your dataset after applying all the above transformations?

In [105]:
len(df_regression.columns)

24